<div style="text-align: center;">
    <img src="https://i.giphy.com/media/v1.Y2lkPTc5MGI3NjExamdmZDVtNjV1OGw3bTJwNXZnbDhocHF0eG0wOGdrb3hoZ3oxNzBqcyZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/pOEbLRT4SwD35IELiQ/giphy.gif" alt="let's go">
</div>

<h1 style="color: #00BFFF;">Python-SQL Connection</h1>

This notebook demonstrates how to establish a connection between Python and MySQL Workbench, retrieve data from an API, and store the data in a MySQL database using an **ELT (Extract, Load, Transform)** approach. 

The focus is on integrating API data into a structured SQL table for further analysis.

<h2 style="color: #00BFFF;">[0]</h2>

In [1]:
# 📚 Basic libraries
import pandas as pd # data manipulation
import numpy as np # numerical operations
import warnings # warning messages management

# 🌐 New Libraries
from getpass import getpass # get password without showing it
import pymysql # MySQL connection

# API
import requests # HTTP requests
import time # time operations

# ⚙️ Settings
pd.set_option('display.max_columns', None) # display all columns
warnings.filterwarnings('ignore') # ignore warnings

In [3]:
def create_connection():
    password = getpass("Please, kindly insert your password: ")
    cnx = pymysql.connect(user='root', password=password, host='localhost')
    
    if cnx.open:
        print("Connection successfully opened.")
        print()
        cursor = cnx.cursor()
        cursor.execute("SHOW DATABASES")
        databases = cursor.fetchall()
        print("Available databases:")
        db_list = [db[0] for db in databases]
        for db in db_list:
            print(f"- {db}")
        print()
    else:
        print("Failed to open connection.")
        print()
        return None
    
    while True:
        database = input("Please, kindly insert your database name: ")
        if database in db_list:
            cnx.select_db(database)
            break
        else:
            print("Invalid database name. Please choose from the available databases.")
            print()
    
    return cnx

<h2 style="color: #00BFFF;">[1] Connecting to MySQL Workbench</h2>

To establish a connection to a MySQL database:

1. Import the required libraries:
   - `pymysql` for MySQL connection.
   - `getpass` for securely handling database passwords.
2. Define a function to create the connection:
   - The `create_connection()` function prompts for the password and database name, and opens a connection to the database.
3. Test the connection:
   - Once connected, the script confirms if the connection was successfully established.

In [6]:
# To test it, use a DB from Drive: LibraryDB, AppleDB or w3schools
connection = create_connection()

Please, kindly insert your password:  ········

Connection successfully opened.

Available databases:
- A_issDB
- AppleDB
- bank
- csv_example
- information_schema
- ISS_DB
- ISS_DB2
- iss_db_final
- iss_db_final_2
- iss_db_test
- last_test
- LibraryDB
- mysql
- new_schema
- performance_schema
- project_DB
- sakila
- sys
- test_db
- testdb
- w3schools

Please, kindly insert your database name:  bank

<h3 style="color: #00BFFF;">How to create a connection:</h3>

In [5]:
# cursor object is used to interact with the database
cursor = connection.cursor()

In [9]:
# .execute() method is used to run SQL querie
cursor.execute("SHOW DATABASES")

21

In [11]:
# .fetchall() method is used to fetch the results of the query
cursor.fetchall()

In [ ]:
connection = pymysql.connect(user='root', password=password, host='localhost')
cursor = connection.cursor()

In [15]:
# .select_db() method is used to select the database
connection.select_db("LibraryDB")

In [16]:
query = input("Please enter your SQL query or command: ")

Please enter your SQL query or command:  show tables

In [17]:
# how to make a df from a query
pd.read_sql(query, connection)

  Tables_in_librarydb
0         activeloans
1              Author
2                Book
3                Loan
4              Member

In [18]:
query = input("Please enter your SQL query or command: ")

Please enter your SQL query or command:  select * from Book limit 5

In [19]:
# how to make a df from a query
pd.read_sql(query, connection)

,book_id,title,genre,publication_year,author_id
0,1,The Grapes of Wrath,Fiction,1939,1
1,2,1984,Dystopia,1949,2
2,3,Pride and Prejudice,Romance,1913,3
3,4,The Adventures of Tom Sawyer,Adventure,1976,4
4,5,New Book Title,Fantasy,2023,1

<h3 style="color: #00BFFF;">Closing the connection</h3>

The data can now be queried, transformed, and analyzed directly within MySQL or exported for further processing in Python.

In [20]:
connection.close()

<div style="text-align: center;">
    <img src="https://i.giphy.com/media/v1.Y2lkPTc5MGI3NjExeTc0ZGs1cHMwdDh3bmtvb2lva3NtZDk1cTB5NGhueW04bW1jdDN6ayZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/4meHSobzwZNncjZ7bZ/giphy.gif" alt="let's go">
</div>

<h2 style="color: #00BFFF;">[2] Retrieving Data</h2>

<center>
<img src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/STS-134_EVA4_view_to_the_Space_Shuttle_Endeavour.jpg/1920px-STS-134_EVA4_view_to_the_Space_Shuttle_Endeavour.jpg"
    style="width:40%;">
</center>

The ISS API provides real-time data about the International Space Station's location and other relevant information. You can access the API documentation [here](https://wheretheiss.at/w/developer).

To get data from the ISS API using Python, you can use the `requests`, `json`, and `time` libraries.

In [26]:
url = "https://api.wheretheiss.at/v1/satellites" # API URL

response = requests.get(url) # GET request
data = response.json() # JSON response
key = str(data[0]["id"])

In [33]:
url = "https://api.wheretheiss.at/v1/satellites/"+key
response = requests.get(url) # GET request
data = response.json() # JSON response

In [34]:
positions = []

for i in range(30):
    response = requests.get(url)
    data = response.json()
    positions.append(data)
    time.sleep(0.5)

In [37]:
df_iss = pd.DataFrame(positions)
df_iss.head(3)

,name,id,latitude,longitude,altitude,velocity,visibility,footprint,timestamp,daynum,solar_lat,solar_lon,units
0,iss,25544,-51.661987,19.552473,435.671036,27538.243666,daylight,4586.346516,1741944070,2.460749e+06,-2.363632,41.994721,kilometers
1,iss,25544,-51.657069,19.651483,435.664177,27538.267505,daylight,4586.312355,1741944071,2.460749e+06,-2.363627,41.990553,kilometers
2,iss,25544,-51.652060,19.750470,435.657281,27538.291421,daylight,4586.278010,1741944072,2.460749e+06,-2.363622,41.986386,kilometers

<h2 style="color: #00BFFF;">[3] ETL: Data Storage</h2>

The **ETL Process**:
1. **Extract**:
   - Retrieve ISS satellite data from the API (`https://api.wheretheiss.at/v1/satellites`).
   - Collect real-time positional data for the ISS over multiple requests.
2. **Transform** (optional):
   - Transformations can be applied directly within SQL later for further analysis.
3. **Load**:
   - Insert the raw API data into the structured SQL table `ISS_Position`.

<h3 style="color: #00BFFF;">Create Database</h3>

In [38]:
connection = create_connection()

Please, kindly insert your password:  ········

Connection successfully opened.

Available databases:
- A_issDB
- AppleDB
- bank
- csv_example
- information_schema
- ISS_DB
- ISS_DB2
- iss_db_final
- iss_db_final_2
- iss_db_test
- last_test
- LibraryDB
- mysql
- new_schema
- performance_schema
- project_DB
- sakila
- sys
- test_db
- testdb
- w3schools

Please, kindly insert your database name:  mysql

In [39]:
cursor = connection.cursor()

In [41]:
cursor.execute("CREATE DATABASE IF NOT EXISTS iss_db_test;")
connection.commit()

In [42]:
connection.select_db("iss_db_test")

In [43]:
pd.read_sql("SHOW TABLES", connection)

Empty DataFrame
Columns: [Tables_in_linux2]
Index: []

<h2 style="color: #00BFFF;">Create your tables</h2>

<div style="text-align: center;">
    <img src="https://i.giphy.com/media/v1.Y2lkPTc5MGI3NjExN3RjeGQ0MGVvazlvZ2d0YzFnNW1ybmsyZ3BuYW5lMzVpZG9kMG1hciZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/l3vRomYKVF3uSY8k8/giphy.gif" alt="let's go">
</div>

In [49]:
connection.select_db("linux2")

In [51]:
# Create a new table in the new schema to store ISS data
create_table_query = """
CREATE TABLE IF NOT EXISTS positions (
    name VARCHAR(10),
    id INT,
    latitude FLOAT,
    longitude FLOAT,
    altitude FLOAT,
    velocity FLOAT,
    visibility VARCHAR(50),
    footprint FLOAT,
    timestamp BIGINT,
    daynum FLOAT,
    solar_lat FLOAT,
    solar_lon FLOAT,
    units VARCHAR(50)
);
"""

# For best usage on VARCHAR, check the maximum length of the data
# BIGINT is used for timestamp because it is in Unix format meaning it is in seconds since 1970
# To add --> primary key auto increment

In [52]:
cursor.execute(create_table_query)
connection.commit()

<h3 style="color: #00BFFF;">Insert the values</h3>

In [53]:
columns = ", ".join(df_iss.columns)
placeholders = ", ".join(["%s"] * len(df_iss.columns))

In [58]:
columns

'name, id, latitude, longitude, altitude, velocity, visibility, footprint, timestamp, daynum, solar_lat, solar_lon, units'

In [57]:
placeholders

'%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s'

In [59]:
insert_query = f"""
INSERT INTO positions ({columns})
VALUES ({placeholders})
"""

In [60]:
for _, row in df_iss.iterrows(): # _ is used to ignore the index,rows is
    cursor.execute(insert_query, tuple(row)) # tuple(row) means
connection.commit()

In [63]:
columns

'name, id, latitude, longitude, altitude, velocity, visibility, footprint, timestamp, daynum, solar_lat, solar_lon, units'

In [62]:
tuple(df_iss.iloc[0])

('iss',
 np.int64(25544),
 np.float64(-51.661987288494),
 np.float64(19.55247296949),
 np.float64(435.67103563248),
 np.float64(27538.243665553),
 'daylight',
 np.float64(4586.3465163906),
 np.int64(1741944070),
 np.float64(2460748.8896991),
 np.float64(-2.3636315519231),
 np.float64(41.994720843788),
 'kilometers')

<h1 style="color: #00BFFF;">TEMPLATE: How to create your tables</h1>

In [ ]:
# 📚 Basic libraries
import pandas as pd # data manipulation
import numpy as np # numerical operations
import warnings # warning messages management

# ⚙️ Settings
pd.set_option('display.max_columns', None) # display all columns
warnings.filterwarnings('ignore') # ignore warnings

# 🌐 New Libraries
from getpass import getpass # get password without showing it
import pymysql # MySQL connection

# ⚙️ Settings
pd.set_option('display.max_columns', None) # display all columns
warnings.filterwarnings('ignore') # ignore warnings

In [ ]:
def create_connection():
    password = getpass("Please, kindly insert your password: ")
    cnx = pymysql.connect(user='root', password=password, host='localhost')
    
    if cnx.open:
        print("Connection successfully opened.")
        print()
        cursor = cnx.cursor()
        cursor.execute("SHOW DATABASES")
        databases = cursor.fetchall()
        print("Available databases:")
        db_list = [db[0] for db in databases]
        for db in db_list:
            print(f"- {db}")
        print()
    else:
        print("Failed to open connection.")
        print()
        return None
    
    while True:
        database = input("Please, kindly insert your database name: ")
        if database in db_list:
            cnx.select_db(database)
            break
        else:
            print("Invalid database name. Please choose from the available databases.")
            print()
    
    return cnx

<h2 style="color: #00BFFF;">[1] Connecting to MySQL Workbench</h2>

In [ ]:
# To test it, use a DB from Drive: LibraryDB, AppleDB or w3schools
connection = create_connection()

<h2 style="color: #00BFFF;">[2] ETL: Data Storage</h2>

In [ ]:
df = pd.read_csv("artworks_data.csv")

In [ ]:
# cursor.execute("create database if not exists iss_db_final;")
# connection.commit()

In [ ]:
connection.select_db("data_artwork")
connection.commit()

In [ ]:
df.head(2)

## Create your tables:

In [ ]:
df.columns

In [ ]:
df.dropna(inplace=True)

In [ ]:
create_table_query = """
CREATE TABLE IF NOT EXISTS artwork (
    artist VARCHAR(255),
    birth FLOAT,
    death FLOAT,
    nationality VARCHAR(255),
    gender VARCHAR(255),
    painting_date FLOAT,
    height FLOAT,
    width FLOAT
);
"""

In [ ]:
cursor = connection.cursor()

In [ ]:
cursor.execute(create_table_query)
connection.commit()

<h3 style="color: #00BFFF;">Insert the values</h3>

In [ ]:
columns = ", ".join(df.columns)
placeholders = ", ".join(["%s"] * len(df.columns))

In [ ]:
insert_query = f"""
INSERT INTO artwork ({columns})
VALUES ({placeholders})
"""

# Change the table name

In [ ]:
for _, row in df.iterrows():
    cursor.execute(insert_query, tuple(row))
connection.commit()

In [ ]:
df.isna().sum()

In [ ]:
df.shape